{
  "version": "0.0.138",
  "buildDate": "12/18/2025, 11:17:53 PM",
  "commits": [
    {
      "hash": "e4b1e39",
      "date": "18.12.2025 23:11",
      "message": "Добавление нового проклятия **🌑 Тьма** с визуальным оверлеем, который затемняет экран и создает круг света вокруг курсора. Обновлены компоненты GameScreen и DeckbuilderScreen для интеграции новой механики. Обновлена документация в memory-bank/gameMechanics.md, memory-bank/gameContent.md и memory-bank/uiDesign.md для отражения изменений."
    },
    {
      "hash": "070664c",
      "date": "18.12.2025 22:29",
      "message": "Обновление модального окна правил: добавлено описание механики проклятий с визуальными элементами и изменением структуры. Обновлены версии в конфигурационных файлах."
    },
    {
      "hash": "ba03794",
      "date": "18.12.2025 22:16",
      "message": "Обновление системы проклятий: добавлены новые механики (Отравление, Закалка, Жадность) с соответствующими визуальными и функциональными изменениями. Обновлены компоненты GameScreen и CurseActivationBanner для интеграции новых эффектов. Обновлена документация в memory-bank/gameMechanics.md, memory-bank/gameContent.md и memory-bank/uiDesign.md для отражения изменений."
    },
    {
      "hash": "8cf3fdb",
      "date": "18.12.2025 21:17",
      "message": "Обновление системы проклятий и улучшение документации"
    },
    {
      "hash": "65504d2",
      "date": "18.12.2025 21:09",
      "message": "Добавление системы проклятий в игру"
    },
    {
      "hash": "03593c2",
      "date": "18.12.2025 18:48",
      "message": "Обновление конфигурационных файлов и компонентов с добавлением пустых строк для улучшения читаемости кода. Также внесены изменения в компонент ConfirmationModal для использования createPortal, что улучшает отображение модального окна. Обновлен GameScreen для интеграции функционала кошелька и добавления кристаллов при победе. Обновлен GameStatsOverlay для отображения собранных монет. Обновлен MainMenu для загрузки баланса при старте и добавления компонента WalletComponent."
    },
    {
      "hash": "8fe8b23",
      "date": "18.12.2025 04:40",
      "message": "Refactor CategoryCard component for improved styling and functionality"
    },
    {
      "hash": "d579581",
      "date": "18.12.2025 03:16",
      "message": "Enhance GameScreen and HUD with discard stats and UI improvements"
    },
    {
      "hash": "23be597",
      "date": "18.12.2025 02:55",
      "message": "Refactor imports in GameScreen and HUDSettingsModal components"
    },
    {
      "hash": "8f73cb3",
      "date": "18.12.2025 02:53",
      "message": "Enhance GameScreen with HUD visibility settings and UI state management"
    },
    {
      "hash": "cc3a236",
      "date": "18.12.2025 02:43",
      "message": "Add monster label functionality and UI enhancements"
    },
    {
      "hash": "b053188",
      "date": "17.12.2025 19:14",
      "message": "Refactor DevQuestStore and component imports for improved clarity"
    },
    {
      "hash": "bd75403",
      "date": "17.12.2025 19:12",
      "message": "Add event listeners and features for enhanced interactivity"
    },
    {
      "hash": "fe4dcc8",
      "date": "17.12.2025 09:21",
      "message": "Refactor imports in GameScreen and RulesModal components"
    },
    {
      "hash": "125faa4",
      "date": "17.12.2025 09:19",
      "message": "Add RulesModal component and integrate into GameScreen"
    },
    {
      "hash": "651f5a0",
      "date": "17.12.2025 07:06",
      "message": "Add SlimeOverlay component and update documentation"
    },
    {
      "hash": "f7e2be1",
      "date": "17.12.2025 07:01",
      "message": "Refactor GhostTrailOverlay to simplify size calculation"
    },
    {
      "hash": "0990e16",
      "date": "17.12.2025 06:59",
      "message": "Add GhostTrailOverlay and FlashlightOverlay components to App"
    },
    {
      "hash": "17a0fd6",
      "date": "17.12.2025 06:49",
      "message": "Add interactive crack overlay feature in MainMenu"
    },
    {
      "hash": "535e92c",
      "date": "17.12.2025 06:45",
      "message": "Refactor mask logic in MainMenu for flashlight mode overlay"
    },
    {
      "hash": "179ab5c",
      "date": "17.12.2025 06:42",
      "message": "Add flashlight mode feature to MainMenu"
    },
    {
      "hash": "7c8f330",
      "date": "17.12.2025 06:35",
      "message": "Add mimic chest Easter egg feature in MainMenu"
    },
    {
      "hash": "af0087a",
      "date": "17.12.2025 06:21",
      "message": "Update screensaver exit transition in MainMenu for smoother animation"
    },
    {
      "hash": "cc56ab6",
      "date": "17.12.2025 06:19",
      "message": "Implement screensaver feature in MainMenu with inactivity tracking and animation"
    },
    {
      "hash": "5c351b3",
      "date": "17.12.2025 06:06",
      "message": "Enhance MainMenu component with new Chaos Mode features and recovery logs"
    },
    {
      "hash": "2be7f3a",
      "date": "17.12.2025 03:19",
      "message": "Refactor MainMenu component by removing unused glitch transform helper"
    },
    {
      "hash": "9a7f93e",
      "date": "17.12.2025 03:18",
      "message": "Implement Chaos Mode in MainMenu with dynamic click detection and visual effects"
    },
    {
      "hash": "e317f8b",
      "date": "17.12.2025 02:45",
      "message": "Enhance Chalkboard and MainMenu components to support dynamic chalk color selection"
    },
    {
      "hash": "3699174",
      "date": "16.12.2025 20:35",
      "message": "Remove content preview from NotesModal to streamline note display and improve layout consistency."
    },
    {
      "hash": "3b06650",
      "date": "16.12.2025 20:32",
      "message": "Enhance NotesModal to sync editor content based on view mode changes"
    },
    {
      "hash": "17f776b",
      "date": "16.12.2025 20:30",
      "message": "Add view mode toggle to NotesModal for enhanced note management"
    },
    {
      "hash": "56fd217",
      "date": "16.12.2025 20:25",
      "message": "Refactor note creation logic in NotesModal and useNotesStore for improved ID handling"
    },
    {
      "hash": "bed3b56",
      "date": "16.12.2025 20:17",
      "message": "Add paste handling functionality in NotesModal component"
    },
    {
      "hash": "9448abb",
      "date": "16.12.2025 20:13",
      "message": "Refactor NotesModal and useNotesStore for improved note synchronization and optimistic updates"
    },
    {
      "hash": "62f3f80",
      "date": "16.12.2025 20:09",
      "message": "Enhance NotesModal and useNotesStore to improve error handling for note editing"
    },
    {
      "hash": "fa71de5",
      "date": "16.12.2025 19:56",
      "message": "Update version history and make minor adjustments across multiple files"
    },
    {
      "hash": "0b5fdcd",
      "date": "16.12.2025 19:52",
      "message": "Add confirmation modal for note deletion in NotesModal component"
    },
    {
      "hash": "c2383ca",
      "date": "16.12.2025 19:44",
      "message": "Implement local state for note title in NotesModal to prevent cursor jumps during editing. Sync local title with active note changes and adjust debounce timing for title updates, enhancing user experience and responsiveness."
    },
    {
      "hash": "12e52f2",
      "date": "16.12.2025 19:37",
      "message": "Refactor NotesModal component to improve handling of empty states and loading indicators. Introduce conditional rendering for loading and empty note scenarios, enhancing user experience by providing clear feedback during data fetching and when no notes are available."
    },
    {
      "hash": "27dc08d",
      "date": "16.12.2025 19:31",
      "message": "Update NotesModal and useNotesStore components to handle author email more robustly, providing a fallback to 'Unknown' or 'Anonymous' when email is not available. This enhances user experience by ensuring consistent display of author information."
    },
    {
      "hash": "d631c71",
      "date": "16.12.2025 19:15",
      "message": "Refactor NotesModal and useNotesStore components to remove unnecessary error handling in remote notes fetching and simplify subscription logic for note updates. This improves code clarity and maintains functionality."
    },
    {
      "hash": "035ea2a",
      "date": "16.12.2025 19:13",
      "message": "Enhance NotesModal component to support user authentication, integrating remote note management with local storage fallback. Implement debounced updates for note content and title, ensuring smooth synchronization. Update UI to reflect loading states and author information, improving user experience for both local and cloud notes."
    },
    {
      "hash": "ed2d39d",
      "date": "16.12.2025 18:43",
      "message": "Refactor AuthModal and useAuthStore components to streamline authentication logic. Remove unnecessary data destructuring in signUp and signIn methods, and add placeholder for signInWithEmail implementation to suppress linter errors."
    },
    {
      "hash": "1697b4d",
      "date": "16.12.2025 18:40",
      "message": "Update dependencies in package.json and package-lock.json, adding @supabase/supabase-js and zustand. Enhance MainMenu component with user authentication features, including login/logout functionality and user profile display. Update version history to reflect changes."
    },
    {
      "hash": "bb80843",
      "date": "16.12.2025 10:32",
      "message": "Update Chalkboard component import statement for cleaner code structure."
    },
    {
      "hash": "457589f",
      "date": "16.12.2025 10:30",
      "message": "Refactor Chalkboard component to use global event listeners for pointer events, improving drawing responsiveness and simplifying event handling. Remove unnecessary local references and optimize stroke updates."
    },
    {
      "hash": "e0aae57",
      "date": "16.12.2025 10:23",
      "message": "Update Chalkboard component to start fading strokes after 10 seconds instead of 5 seconds, enhancing visual effects."
    },
    {
      "hash": "efd998b",
      "date": "16.12.2025 10:19",
      "message": "Add Chalkboard component to MainMenu"
    },
    {
      "hash": "e507de4",
      "date": "16.12.2025 10:06",
      "message": "Update VersionModal component and version history data for version 0.0.89, improving commit list rendering and adding new commit details."
    },
    {
      "hash": "8a194a6",
      "date": "16.12.2025 10:04",
      "message": "Update package.json scripts to include version generation and enhance MainMenu with version history feature. Add version badge and modal for displaying version information, improving user experience and accessibility to version details."
    }
  ]
}