{
  "version": "0.1.3",
  "buildDate": "12/20/2025, 12:45:47 AM",
  "baseRef": "c85a59e31ae9575fcce07d6a8a24de2e536ebf5b",
  "commits": [
    {
      "hash": "4fce0c5",
      "date": "20.12.2025 00:33",
      "message": "Фикс багов Торговца"
    },
    {
      "hash": "5c92a44",
      "date": "19.12.2025 23:45",
      "message": "Добавление механики \"Странствующий торговец\" с оверлеем для покупки артефактов. Реализованы базовые функции: появление торговца между раундами, возможность покупки артефактов за 💎, а также токен \"Уйти\". Обновлены компоненты для поддержки новой механики и улучшения UX."
    },
    {
      "hash": "90e31d4",
      "date": "19.12.2025 15:42",
      "message": "v0.1.0 - тотальный рефакторинг внутренней структуры"
    },
    {
      "hash": "c85a59e",
      "date": "19.12.2025 01:35",
      "message": "Удаление устаревших компонентов и файлов из проекта, включая редакторы категорий, игровые компоненты и систему перков. Обновлена документация в memory-bank/tasks.md для отражения текущего статуса рефакторинга архитектуры. Обновлены конфигурационные файлы для соответствия изменениям."
    },
    {
      "hash": "ad2b034",
      "date": "18.12.2025 23:21",
      "message": "Обновление компонента CurseSlot: добавлен новый элемент \"Проклятье\" с подписью под токеном. Изменены стили для улучшения визуального восприятия. Обновлена документация в memory-bank/uiDesign.md для отражения изменений в дизайне."
    },
    {
      "hash": "e4b1e39",
      "date": "18.12.2025 23:11",
      "message": "Добавление нового проклятия **🌑 Тьма** с визуальным оверлеем, который затемняет экран и создает круг света вокруг курсора. Обновлены компоненты GameScreen и DeckbuilderScreen для интеграции новой механики. Обновлена документация в memory-bank/gameMechanics.md, memory-bank/gameContent.md и memory-bank/uiDesign.md для отражения изменений."
    },
    {
      "hash": "070664c",
      "date": "18.12.2025 22:29",
      "message": "Обновление модального окна правил: добавлено описание механики проклятий с визуальными элементами и изменением структуры. Обновлены версии в конфигурационных файлах."
    },
    {
      "hash": "ba03794",
      "date": "18.12.2025 22:16",
      "message": "Обновление системы проклятий: добавлены новые механики (Отравление, Закалка, Жадность) с соответствующими визуальными и функциональными изменениями. Обновлены компоненты GameScreen и CurseActivationBanner для интеграции новых эффектов. Обновлена документация в memory-bank/gameMechanics.md, memory-bank/gameContent.md и memory-bank/uiDesign.md для отражения изменений."
    },
    {
      "hash": "8cf3fdb",
      "date": "18.12.2025 21:17",
      "message": "Обновление системы проклятий и улучшение документации"
    },
    {
      "hash": "65504d2",
      "date": "18.12.2025 21:09",
      "message": "Добавление системы проклятий в игру"
    },
    {
      "hash": "03593c2",
      "date": "18.12.2025 18:48",
      "message": "Обновление конфигурационных файлов и компонентов с добавлением пустых строк для улучшения читаемости кода. Также внесены изменения в компонент ConfirmationModal для использования createPortal, что улучшает отображение модального окна. Обновлен GameScreen для интеграции функционала кошелька и добавления кристаллов при победе. Обновлен GameStatsOverlay для отображения собранных монет. Обновлен MainMenu для загрузки баланса при старте и добавления компонента WalletComponent."
    },
    {
      "hash": "8fe8b23",
      "date": "18.12.2025 04:40",
      "message": "Refactor CategoryCard component for improved styling and functionality"
    },
    {
      "hash": "d579581",
      "date": "18.12.2025 03:16",
      "message": "Enhance GameScreen and HUD with discard stats and UI improvements"
    },
    {
      "hash": "23be597",
      "date": "18.12.2025 02:55",
      "message": "Refactor imports in GameScreen and HUDSettingsModal components"
    },
    {
      "hash": "8f73cb3",
      "date": "18.12.2025 02:53",
      "message": "Enhance GameScreen with HUD visibility settings and UI state management"
    },
    {
      "hash": "cc3a236",
      "date": "18.12.2025 02:43",
      "message": "Add monster label functionality and UI enhancements"
    },
    {
      "hash": "b053188",
      "date": "17.12.2025 19:14",
      "message": "Refactor DevQuestStore and component imports for improved clarity"
    },
    {
      "hash": "bd75403",
      "date": "17.12.2025 19:12",
      "message": "Add event listeners and features for enhanced interactivity"
    },
    {
      "hash": "fe4dcc8",
      "date": "17.12.2025 09:21",
      "message": "Refactor imports in GameScreen and RulesModal components"
    },
    {
      "hash": "125faa4",
      "date": "17.12.2025 09:19",
      "message": "Add RulesModal component and integrate into GameScreen"
    },
    {
      "hash": "651f5a0",
      "date": "17.12.2025 07:06",
      "message": "Add SlimeOverlay component and update documentation"
    },
    {
      "hash": "f7e2be1",
      "date": "17.12.2025 07:01",
      "message": "Refactor GhostTrailOverlay to simplify size calculation"
    },
    {
      "hash": "0990e16",
      "date": "17.12.2025 06:59",
      "message": "Add GhostTrailOverlay and FlashlightOverlay components to App"
    },
    {
      "hash": "17a0fd6",
      "date": "17.12.2025 06:49",
      "message": "Add interactive crack overlay feature in MainMenu"
    },
    {
      "hash": "535e92c",
      "date": "17.12.2025 06:45",
      "message": "Refactor mask logic in MainMenu for flashlight mode overlay"
    },
    {
      "hash": "179ab5c",
      "date": "17.12.2025 06:42",
      "message": "Add flashlight mode feature to MainMenu"
    },
    {
      "hash": "7c8f330",
      "date": "17.12.2025 06:35",
      "message": "Add mimic chest Easter egg feature in MainMenu"
    },
    {
      "hash": "af0087a",
      "date": "17.12.2025 06:21",
      "message": "Update screensaver exit transition in MainMenu for smoother animation"
    },
    {
      "hash": "cc56ab6",
      "date": "17.12.2025 06:19",
      "message": "Implement screensaver feature in MainMenu with inactivity tracking and animation"
    },
    {
      "hash": "5c351b3",
      "date": "17.12.2025 06:06",
      "message": "Enhance MainMenu component with new Chaos Mode features and recovery logs"
    },
    {
      "hash": "2be7f3a",
      "date": "17.12.2025 03:19",
      "message": "Refactor MainMenu component by removing unused glitch transform helper"
    },
    {
      "hash": "9a7f93e",
      "date": "17.12.2025 03:18",
      "message": "Implement Chaos Mode in MainMenu with dynamic click detection and visual effects"
    },
    {
      "hash": "e317f8b",
      "date": "17.12.2025 02:45",
      "message": "Enhance Chalkboard and MainMenu components to support dynamic chalk color selection"
    },
    {
      "hash": "3699174",
      "date": "16.12.2025 20:35",
      "message": "Remove content preview from NotesModal to streamline note display and improve layout consistency."
    },
    {
      "hash": "3b06650",
      "date": "16.12.2025 20:32",
      "message": "Enhance NotesModal to sync editor content based on view mode changes"
    },
    {
      "hash": "17f776b",
      "date": "16.12.2025 20:30",
      "message": "Add view mode toggle to NotesModal for enhanced note management"
    },
    {
      "hash": "56fd217",
      "date": "16.12.2025 20:25",
      "message": "Refactor note creation logic in NotesModal and useNotesStore for improved ID handling"
    },
    {
      "hash": "bed3b56",
      "date": "16.12.2025 20:17",
      "message": "Add paste handling functionality in NotesModal component"
    },
    {
      "hash": "9448abb",
      "date": "16.12.2025 20:13",
      "message": "Refactor NotesModal and useNotesStore for improved note synchronization and optimistic updates"
    },
    {
      "hash": "62f3f80",
      "date": "16.12.2025 20:09",
      "message": "Enhance NotesModal and useNotesStore to improve error handling for note editing"
    },
    {
      "hash": "fa71de5",
      "date": "16.12.2025 19:56",
      "message": "Update version history and make minor adjustments across multiple files"
    },
    {
      "hash": "0b5fdcd",
      "date": "16.12.2025 19:52",
      "message": "Add confirmation modal for note deletion in NotesModal component"
    },
    {
      "hash": "c2383ca",
      "date": "16.12.2025 19:44",
      "message": "Implement local state for note title in NotesModal to prevent cursor jumps during editing. Sync local title with active note changes and adjust debounce timing for title updates, enhancing user experience and responsiveness."
    },
    {
      "hash": "12e52f2",
      "date": "16.12.2025 19:37",
      "message": "Refactor NotesModal component to improve handling of empty states and loading indicators. Introduce conditional rendering for loading and empty note scenarios, enhancing user experience by providing clear feedback during data fetching and when no notes are available."
    },
    {
      "hash": "27dc08d",
      "date": "16.12.2025 19:31",
      "message": "Update NotesModal and useNotesStore components to handle author email more robustly, providing a fallback to 'Unknown' or 'Anonymous' when email is not available. This enhances user experience by ensuring consistent display of author information."
    },
    {
      "hash": "d631c71",
      "date": "16.12.2025 19:15",
      "message": "Refactor NotesModal and useNotesStore components to remove unnecessary error handling in remote notes fetching and simplify subscription logic for note updates. This improves code clarity and maintains functionality."
    },
    {
      "hash": "035ea2a",
      "date": "16.12.2025 19:13",
      "message": "Enhance NotesModal component to support user authentication, integrating remote note management with local storage fallback. Implement debounced updates for note content and title, ensuring smooth synchronization. Update UI to reflect loading states and author information, improving user experience for both local and cloud notes."
    },
    {
      "hash": "ed2d39d",
      "date": "16.12.2025 18:43",
      "message": "Refactor AuthModal and useAuthStore components to streamline authentication logic. Remove unnecessary data destructuring in signUp and signIn methods, and add placeholder for signInWithEmail implementation to suppress linter errors."
    },
    {
      "hash": "1697b4d",
      "date": "16.12.2025 18:40",
      "message": "Update dependencies in package.json and package-lock.json, adding @supabase/supabase-js and zustand. Enhance MainMenu component with user authentication features, including login/logout functionality and user profile display. Update version history to reflect changes."
    },
    {
      "hash": "bb80843",
      "date": "16.12.2025 10:32",
      "message": "Update Chalkboard component import statement for cleaner code structure."
    },
    {
      "hash": "457589f",
      "date": "16.12.2025 10:30",
      "message": "Refactor Chalkboard component to use global event listeners for pointer events, improving drawing responsiveness and simplifying event handling. Remove unnecessary local references and optimize stroke updates."
    },
    {
      "hash": "e0aae57",
      "date": "16.12.2025 10:23",
      "message": "Update Chalkboard component to start fading strokes after 10 seconds instead of 5 seconds, enhancing visual effects."
    },
    {
      "hash": "efd998b",
      "date": "16.12.2025 10:19",
      "message": "Add Chalkboard component to MainMenu"
    },
    {
      "hash": "e507de4",
      "date": "16.12.2025 10:06",
      "message": "Update VersionModal component and version history data for version 0.0.89, improving commit list rendering and adding new commit details."
    },
    {
      "hash": "8a194a6",
      "date": "16.12.2025 10:04",
      "message": "Update package.json scripts to include version generation and enhance MainMenu with version history feature. Add version badge and modal for displaying version information, improving user experience and accessibility to version details."
    },
    {
      "hash": "b31dfc5",
      "date": "16.12.2025 09:30",
      "message": "Enhance NotesModal component by adding a new resize handle for the bottom side, allowing users to resize the modal vertically. Update interaction handling to support the new 'resize-s' type, improving overall user experience with modal resizing functionality."
    },
    {
      "hash": "78fa9cf",
      "date": "16.12.2025 08:49",
      "message": "Refactor NotesModal to consolidate window state management, enabling persistent resizing and repositioning. Introduce new resize handles for improved user interaction and update local storage handling for window dimensions."
    },
    {
      "hash": "ad7aa88",
      "date": "16.12.2025 08:45",
      "message": "Refactor NotesModal component to enhance interaction handling for resizing and moving. Introduce new state management for position and size, improving user experience with draggable and resizable modal functionality."
    },
    {
      "hash": "0cdfdef",
      "date": "16.12.2025 05:18",
      "message": "Add Notes feature to DeckbuilderScreen with modal integration"
    },
    {
      "hash": "6cedb54",
      "date": "16.12.2025 04:45",
      "message": "Add visual effects for Junk and Bones abilities in GameScreen"
    },
    {
      "hash": "ab189e7",
      "date": "16.12.2025 04:43",
      "message": "Enhance GameScreen and gameReducer to prevent selling 'skull' items from the backpack. Update visual feedback for 'skull' sales and adjust hand clearing logic to include 'skull' type, improving game state management and user experience."
    },
    {
      "hash": "43af456",
      "date": "16.12.2025 04:08",
      "message": "Remove 'graveyard' ability and associated logic from monster abilities and game reducer. Update relevant types to reflect this change, streamlining the codebase and improving maintainability."
    },
    {
      "hash": "a09435f",
      "date": "16.12.2025 04:02",
      "message": "Remove 'Барьер' spell and related logic from GameScreen and gameReducer. Update spell types and adjust GameScreen's non-damage removal checks accordingly to reflect the changes in spell availability."
    },
    {
      "hash": "a68387e",
      "date": "16.12.2025 03:59",
      "message": "Enhance GameScreen logic to handle monster fleeing scenarios. Introduce specific checks for 'БЕГСТВО' log to accurately reflect damage taken during escape. Update monster ability description for clarity on fleeing conditions. Improve logging for monster attacks to include HP details upon fleeing."
    },
    {
      "hash": "a5e4697",
      "date": "16.12.2025 03:46",
      "message": "Implement sequential HP visualization in GameScreen. Introduce HpUpdate interface and update gameReducer to manage HP changes with timestamps. Refactor HP display logic to use visualHp state for smoother animations during gameplay."
    },
    {
      "hash": "8a7665c",
      "date": "16.12.2025 03:33",
      "message": "Update 'whisper' ability description and logic to reflect card peeking mechanics. Adjust logging messages for clarity when no cards are available in the deck."
    },
    {
      "hash": "52eb99a",
      "date": "16.12.2025 03:28",
      "message": "Fix GameScreen backpack reference to correctly access card ID. Remove unused gamePlusReducer file to streamline codebase and improve maintainability."
    },
    {
      "hash": "c60c72e",
      "date": "16.12.2025 03:26",
      "message": "Refactor GameScreen and gameReducer to improve reset logic. Introduce canReset condition based on player HP and cards on the table, enhancing game state management. Update reset button styling to reflect new reset conditions, ensuring better user experience during gameplay."
    },
    {
      "hash": "ec0439b",
      "date": "16.12.2025 03:10",
      "message": "Enhance game state management by introducing a location prop for Card and Slot components, allowing for better tracking of card positions (hand, backpack, field). Update GameScreen and gameReducer to accommodate the new structure, ensuring proper handling of card interactions and state updates. Refactor related components to improve code clarity and maintainability."
    },
    {
      "hash": "652b583",
      "date": "15.12.2025 23:06",
      "message": "Enhance CardComponent and Slot components with drag state management. Add onDragChange prop to CardComponent for notifying parent about drag status. Update Slot component to handle child dragging state and adjust visual feedback accordingly, improving user interaction during drag-and-drop operations."
    },
    {
      "hash": "d5dee77",
      "date": "15.12.2025 16:23",
      "message": "Refactor GamePlusScreen component by removing unused imports and interface definitions, and re-enable saveRun functionality. Update index.css to remove duplicate font import. Clean up gameReducer by removing deadCoin case, streamlining the code for better maintainability."
    },
    {
      "hash": "49942af",
      "date": "15.12.2025 16:16",
      "message": "!!!2"
    },
    {
      "hash": "28cd500",
      "date": "15.12.2025 16:00",
      "message": "!!!"
    },
    {
      "hash": "16f70fd",
      "date": "15.12.2025 12:23",
      "message": "Remove 'public' from .gitignore to streamline ignored files, ensuring only relevant directories are excluded from version control."
    },
    {
      "hash": "636e844",
      "date": "15.12.2025 12:17",
      "message": "Fix image path in MainMenu component by correcting the filename format for the extra image. This update ensures proper loading of the image asset and maintains consistency in the image naming convention."
    },
    {
      "hash": "e663eb0",
      "date": "15.12.2025 12:14",
      "message": "Add sticker functionality to MainMenu component. Implement random sticker images with dynamic positioning and interactive features, enhancing visual engagement and user experience. Include a fullscreen overlay for enlarged sticker viewing with captions."
    },
    {
      "hash": "e629429",
      "date": "15.12.2025 10:30",
      "message": "Update quotes in MainMenu component to reflect new humorous messages about Serega and Kirill. This change enhances the thematic engagement of the interface by adding fresh, playful content that resonates with the game's spirit."
    },
    {
      "hash": "26c1299",
      "date": "15.12.2025 10:28",
      "message": "Add dynamic footer quotes to MainMenu component. Implement a rotating quote feature that updates every 5 seconds, enhancing user engagement with humorous and thematic messages related to the game. This update enriches the overall user experience and adds a playful element to the interface."
    },
    {
      "hash": "0b3db49",
      "date": "15.12.2025 10:11",
      "message": "Refactor drag event handling in GameScreen components to improve code consistency. Update onDragEnd callbacks in CardsViewer, OverheadStatsWindow, and GameLogWindow to remove unused event parameter, enhancing readability and maintainability."
    },
    {
      "hash": "fedfada",
      "date": "15.12.2025 10:09",
      "message": "Implement draggable window positions for CardsViewer, OverheadStatsWindow, and GameLogWindow in GameScreen. Add reset layout functionality and enhance UI interactions with hover effects for better user experience. This update improves layout management and user control over window positioning."
    },
    {
      "hash": "cd54a3c",
      "date": "15.12.2025 09:36",
      "message": "!!! Stable Version"
    },
    {
      "hash": "15bc074",
      "date": "15.12.2025 08:46",
      "message": "Enhance GameLogWindow in GameScreen with drag functionality and improved expansion behavior. Integrate drag controls for better user interaction, allowing users to move the log window while maintaining a clean UI. Update expansion logic to improve visual feedback and usability."
    },
    {
      "hash": "2db25ea",
      "date": "15.12.2025 08:19",
      "message": "Refactor conditional rendering in CardsViewer to improve clarity. Remove commented-out logic for cleaner code and maintain consistent UI behavior when no cards are displayed."
    },
    {
      "hash": "e9f4e9b",
      "date": "15.12.2025 08:01",
      "message": "Refactor DeckViewer to CardsViewer for improved clarity and functionality. Update card display logic, navigation handling, and conditional rendering based on the label. Enhance UI responsiveness and maintainability in GameScreen by integrating CardsViewer for both deck and discard pile."
    },
    {
      "hash": "fe5adc6",
      "date": "15.12.2025 07:56",
      "message": "Add DeckViewer and MiniCard components to GameScreen for enhanced card display and navigation. Implement left/right navigation buttons and hover effects for better user interaction with the deck. This update improves the visual representation of cards and overall gameplay experience."
    },
    {
      "hash": "c91f7a6",
      "date": "15.12.2025 07:38",
      "message": "Remove unused import of RefreshCw icon from GameScreen to streamline code and improve component clarity."
    },
    {
      "hash": "d849560",
      "date": "15.12.2025 07:25",
      "message": "Add God Mode functionality to GameScreen and gameReducer. Introduce toggle for God Mode visibility, update game state to manage invulnerability during gameplay, and enhance UI with corresponding visual feedback. This improves user experience by allowing players to test strategies without penalties."
    },
    {
      "hash": "6e996ed",
      "date": "15.12.2025 06:49",
      "message": "Enhance OverheadStatsWindow in GameScreen with drag functionality and improved cursor styles for better user interaction. This update allows users to move the stats window while maintaining a clean UI."
    },
    {
      "hash": "475ec91",
      "date": "15.12.2025 06:46",
      "message": "Remove unused 2x button from GameScreen to streamline the UI and improve overall component clarity."
    },
    {
      "hash": "7bca6ce",
      "date": "15.12.2025 05:30",
      "message": "Add ErrorBoundary component to App for improved error handling. Refactor App layout to include ErrorBoundary, ensuring better user experience during runtime errors. Remove unused layout prop from StatsScreen for cleaner code."
    },
    {
      "hash": "4ccff3f",
      "date": "15.12.2025 05:19",
      "message": "Remove unused useRef import from DeckbuilderScreen, streamlining component code for better readability and performance."
    },
    {
      "hash": "8c236fa",
      "date": "15.12.2025 05:11",
      "message": "Refactor DeckbuilderScreen layout for improved UI. Adjust header spacing and visibility of the back button text on smaller screens. Enhance content area with a more prominent title and description, improving overall user experience and clarity."
    },
    {
      "hash": "7fa4d55",
      "date": "15.12.2025 05:09",
      "message": "Add export and import modals to DeckbuilderScreen for sharing and loading deck configurations. Implement clipboard functionality for sharing and error handling for imports, enhancing user experience and deck management."
    },
    {
      "hash": "28fa57c",
      "date": "15.12.2025 04:48",
      "message": "Enhance GameScreen and gameReducer to support new 'corpseeater' effect. Update visual feedback for HP restoration on enemy slots and improve last effect handling in GameScreen, ensuring clearer gameplay dynamics and user notifications."
    },
    {
      "hash": "0420291",
      "date": "15.12.2025 04:41",
      "message": "Refactor GameScreen and gameReducer to enhance debuff handling. Update visual representation of coins and active effects in GameScreen, and adjust damage calculations in gameReducer to account for 'miss' effects, improving gameplay clarity and user feedback."
    },
    {
      "hash": "7259c64",
      "date": "15.12.2025 04:28",
      "message": "Update gameReducer to replace junk coin with junk skull card, enhancing gameplay by adding new mechanics for backpack management. Implement log messages for adding skulls and handling full or blocked backpacks, improving player feedback and experience."
    },
    {
      "hash": "29c14e7",
      "date": "15.12.2025 04:25",
      "message": "Refactor gameReducer to ensure player state is preserved during ability applications. Update max HP restoration logic for 'exhaustion' ability to also restore current HP, enhancing gameplay feedback with clearer log messages."
    },
    {
      "hash": "15290ab",
      "date": "15.12.2025 04:15",
      "message": "Implement corrosion effect handling in GameScreen and gameReducer. Add visual feedback for corrosion effects on card slots, updating state management to track last effects. Enhance gameplay dynamics by providing clear notifications for weakened cards, improving user experience."
    },
    {
      "hash": "f766768",
      "date": "15.12.2025 03:55",
      "message": "Enhance GameScreen and gameReducer to support 'beacon' ability mechanics. Update peekType handling and visual feedback in GameScreen based on the new ability, ensuring players receive clear notifications about upcoming monsters. Modify monsterAbilities description for clarity on 'beacon' functionality, improving gameplay dynamics and user experience."
    },
    {
      "hash": "76754f5",
      "date": "15.12.2025 03:52",
      "message": "Add skull card type and related mechanics in CardComponent, GameScreen, and gameReducer. Update deck stats to include skull cards, implement random insertion of skull cards into the deck, and adjust log messages for skull interactions, enhancing gameplay dynamics and user experience."
    },
    {
      "hash": "84a1552",
      "date": "15.12.2025 03:20",
      "message": "Add web ability handling in GameScreen to block card interactions. Introduce visual feedback for web status in the backpack slot, enhancing gameplay dynamics and user experience."
    },
    {
      "hash": "afdc682",
      "date": "15.12.2025 03:17",
      "message": "Enhance CardComponent, GameScreen, and Slot to support new penalty mechanics. Introduce penalty prop for visual effects in CardComponent and update GameScreen to apply penalties based on monster abilities. Ensure consistent handling of penalties across components, improving gameplay dynamics and visual feedback."
    },
    {
      "hash": "48553c6",
      "date": "15.12.2025 03:07",
      "message": "Refactor 'offering' ability in gameReducer to enhance healing mechanics for monsters. Update log messages for clarity on healing actions and conditions, ensuring better player feedback during gameplay."
    },
    {
      "hash": "183fd27",
      "date": "15.12.2025 02:52",
      "message": "Implement sell block functionality in GameScreen to prevent selling monsters with the 'scream' ability. Update sell button appearance and behavior based on sell block state, enhancing user feedback and gameplay mechanics."
    },
    {
      "hash": "b5eb2e6",
      "date": "15.12.2025 02:40",
      "message": "Enhance GameScreen and gameReducer to support graveyard revival mechanics. Implement visual feedback for revived monsters in GameScreen, including floating text notifications. Update gameReducer to manage monster revival logic, ensuring proper handling of empty slots and discard pile interactions."
    },
    {
      "hash": "0fcabec",
      "date": "15.12.2025 01:46",
      "message": "Enhance CardComponent and GameScreen to support isBlocked functionality for stealth mechanics. Update drag behavior and visual feedback for blocked cards in CardComponent. Implement stealth block checks in GameScreen for monster interactions and spells, ensuring consistent gameplay rules. Refactor gameReducer to enforce stealth interactions, improving game logic clarity."
    },
    {
      "hash": "80787d9",
      "date": "15.12.2025 01:07",
      "message": "Implement mirror ability for monsters in gameReducer and GameScreen. Introduce updateMirrorMonsters function to adjust monster values based on maximum weapon damage, enhancing gameplay dynamics. Update floating text display for mirror actions in GameScreen to improve visual feedback."
    },
    {
      "hash": "f3b29ac",
      "date": "15.12.2025 00:56",
      "message": "Implement delayed healing effect in GameScreen for Blessing logs. Add state management for heal flash and adjust floating text display based on recent logs, enhancing visual feedback for healing actions."
    },
    {
      "hash": "50bceb8",
      "date": "15.12.2025 00:45",
      "message": "Enhance FloatingText functionality in GameScreen to support centered text display. Update addFloatingText function to accept a centered parameter, improving visual alignment for floating text messages."
    },
    {
      "hash": "b21cc0a",
      "date": "15.12.2025 00:35",
      "message": "Enhance GameScreen and gameReducer to support new peekType feature, allowing dynamic display of card hints based on game state. Update GameState interface to include peekType and adjust logic for whisper and epiphany actions."
    },
    {
      "hash": "616c533",
      "date": "15.12.2025 00:31",
      "message": "Update coin display logic in GameScreen to spawn floating text at the right edge of the hero's bounding box, improving visual feedback for coin gains and losses."
    },
    {
      "hash": "5e77835",
      "date": "15.12.2025 00:20",
      "message": "Add ability picker to MonstersEditor for enhancing monster groups. Introduce a button to trigger the ability selection and update groups with selected abilities, improving gameplay customization."
    },
    {
      "hash": "ecff6fa",
      "date": "15.12.2025 00:16",
      "message": "Enhance GameScreen to display monster ability icons alongside cards and update gameReducer to ensure consistent naming for monster cards. This improves visual feedback and clarity for players."
    },
    {
      "hash": "1c94688",
      "date": "15.12.2025 00:10",
      "message": "Add monster ability badge to CardComponent and update icons in monsterAbilities data. Ensure consistent icon usage in gameReducer for monster cards."
    },
    {
      "hash": "e9b1634",
      "date": "14.12.2025 23:58",
      "message": "Add filtering functionality to StatsScreen for run history, allowing users to view all, standard, custom, or template runs. Introduce FilterButton component for improved UI interaction."
    },
    {
      "hash": "ef2164f",
      "date": "14.12.2025 23:56",
      "message": "Add dashboard stats to StatsScreen with win/loss calculations for standard, custom, and template run types"
    },
    {
      "hash": "d570f58",
      "date": "14.12.2025 23:11",
      "message": "Implement pre-check for selling monster cards in gameReducer to prevent selling actions on monster type cards, enhancing game state integrity."
    },
    {
      "hash": "d1e2860",
      "date": "14.12.2025 09:58",
      "message": "Fix Spells"
    },
    {
      "hash": "f076657",
      "date": "14.12.2025 04:56",
      "message": "Update gameReducer to prevent state changes when the game status is 'lost', ensuring that the game state remains consistent and unaltered after a loss."
    },
    {
      "hash": "3e31c63",
      "date": "14.12.2025 04:47",
      "message": "Refactor MainMenu to replace the statistics button with a MenuButton component for improved UI consistency. Update StatsScreen to enhance the display of custom run types and include template names in the history card layout."
    },
    {
      "hash": "4e0ab7e",
      "date": "14.12.2025 04:40",
      "message": "Update gameReducer to track monster deaths during combat by incrementing the monstersKilled stat when a monster dies attacking the player or shield. This enhances game state management for combat outcomes."
    },
    {
      "hash": "f693d7b",
      "date": "14.12.2025 04:30",
      "message": "Implement peek cards feature in GameScreen and update game state management to include peekCards. Add Epiphany effect timer and enhance gameReducer to handle peek card visibility and clearing logic."
    },
    {
      "hash": "029cf4a",
      "date": "14.12.2025 04:16",
      "message": "Enhance GameScreen and gameReducer to handle non-damage card removals and restore monster HP on wind spell usage. Update StatsScreen layout for improved visual consistency."
    },
    {
      "hash": "3feb23a",
      "date": "14.12.2025 04:03",
      "message": "Refactor DeckbuilderScreen to set maxHp for custom player configuration, clean up imports in MonstersEditor and SpellsEditor, and update activeEffects type in game state to include 'miss'. Enhance gameReducer to streamline handling of 'miss' effect in combat logic."
    },
    {
      "hash": "6283787",
      "date": "14.12.2025 04:01",
      "message": "Implement template management features, including saving and loading deck templates, and enhance game state management to support template usage. Update UI components for better user experience in the deckbuilder and main menu."
    },
    {
      "hash": "6167484",
      "date": "14.12.2025 03:49",
      "message": "Refactor multiple editor components to streamline delete functionality, enhance UI elements, and improve overall layout consistency. Update game state management to include new monster abilities and integrate them into the game logic."
    },
    {
      "hash": "60c10aa",
      "date": "14.12.2025 03:04",
      "message": "Refactor gameReducer to remove unused variable and enhance state management for card updates in player hands."
    },
    {
      "hash": "7f3b73e",
      "date": "14.12.2025 03:02",
      "message": "Refactor imports in multiple components and update game logic to utilize spell definitions from data. Remove unused imports and streamline code for better readability."
    },
    {
      "hash": "5cdf2aa",
      "date": "14.12.2025 02:59",
      "message": "Implement deckbuilder screen and enhance game state management for custom game configurations"
    },
    {
      "hash": "ca3ce3d",
      "date": "13.12.2025 23:56",
      "message": "Add exit confirmation modal to GameScreen for user confirmation before exiting the game"
    },
    {
      "hash": "40fddd3",
      "date": "13.12.2025 23:46",
      "message": "Add confirmation modal for clearing run history in StatsScreen and refactor GameScreen to use the new modal component"
    },
    {
      "hash": "c0ec56a",
      "date": "13.12.2025 23:43",
      "message": "Add stats screen and integrate game state management for displaying statistics"
    },
    {
      "hash": "d359df6",
      "date": "13.12.2025 23:36",
      "message": "Add game statistics tracking a"
    },
    {
      "hash": "b049c62",
      "date": "13.12.2025 23:28",
      "message": "Add HUD 3"
    },
    {
      "hash": "b046efe",
      "date": "13.12.2025 23:16",
      "message": "Add HUD 2"
    },
    {
      "hash": "500af0d",
      "date": "13.12.2025 23:08",
      "message": "Add HUD 1"
    },
    {
      "hash": "6e2b327",
      "date": "13.12.2025 22:59",
      "message": "PerksFix"
    },
    {
      "hash": "a622a1a",
      "date": "13.12.2025 22:55",
      "message": "BugFix"
    },
    {
      "hash": "0592993",
      "date": "13.12.2025 22:48",
      "message": "Animation"
    },
    {
      "hash": "e527efd",
      "date": "13.12.2025 21:49",
      "message": "Fix TS6133 unused fromWhere"
    },
    {
      "hash": "bb6f3a2",
      "date": "13.12.2025 21:45",
      "message": "Fix build errors: unused imports and type issues"
    },
    {
      "hash": "6607f44",
      "date": "13.12.2025 21:40",
      "message": "Initial commit for Vercel deployment"
    },
    {
      "hash": "8d2b49f",
      "date": "13.12.2025 21:35",
      "message": "initial commit"
    }
  ]
}