{
  "version": "0.0.114",
  "buildDate": "12/17/2025, 6:08:33 AM",
  "commits": [
    {
      "hash": "5c351b3",
      "date": "17.12.2025 06:06",
      "message": "Enhance MainMenu component with new Chaos Mode features and recovery logs"
    },
    {
      "hash": "2be7f3a",
      "date": "17.12.2025 03:19",
      "message": "Refactor MainMenu component by removing unused glitch transform helper"
    },
    {
      "hash": "9a7f93e",
      "date": "17.12.2025 03:18",
      "message": "Implement Chaos Mode in MainMenu with dynamic click detection and visual effects"
    },
    {
      "hash": "e317f8b",
      "date": "17.12.2025 02:45",
      "message": "Enhance Chalkboard and MainMenu components to support dynamic chalk color selection"
    },
    {
      "hash": "3699174",
      "date": "16.12.2025 20:35",
      "message": "Remove content preview from NotesModal to streamline note display and improve layout consistency."
    },
    {
      "hash": "3b06650",
      "date": "16.12.2025 20:32",
      "message": "Enhance NotesModal to sync editor content based on view mode changes"
    },
    {
      "hash": "17f776b",
      "date": "16.12.2025 20:30",
      "message": "Add view mode toggle to NotesModal for enhanced note management"
    },
    {
      "hash": "56fd217",
      "date": "16.12.2025 20:25",
      "message": "Refactor note creation logic in NotesModal and useNotesStore for improved ID handling"
    },
    {
      "hash": "bed3b56",
      "date": "16.12.2025 20:17",
      "message": "Add paste handling functionality in NotesModal component"
    },
    {
      "hash": "9448abb",
      "date": "16.12.2025 20:13",
      "message": "Refactor NotesModal and useNotesStore for improved note synchronization and optimistic updates"
    },
    {
      "hash": "62f3f80",
      "date": "16.12.2025 20:09",
      "message": "Enhance NotesModal and useNotesStore to improve error handling for note editing"
    },
    {
      "hash": "fa71de5",
      "date": "16.12.2025 19:56",
      "message": "Update version history and make minor adjustments across multiple files"
    },
    {
      "hash": "0b5fdcd",
      "date": "16.12.2025 19:52",
      "message": "Add confirmation modal for note deletion in NotesModal component"
    },
    {
      "hash": "c2383ca",
      "date": "16.12.2025 19:44",
      "message": "Implement local state for note title in NotesModal to prevent cursor jumps during editing. Sync local title with active note changes and adjust debounce timing for title updates, enhancing user experience and responsiveness."
    },
    {
      "hash": "12e52f2",
      "date": "16.12.2025 19:37",
      "message": "Refactor NotesModal component to improve handling of empty states and loading indicators. Introduce conditional rendering for loading and empty note scenarios, enhancing user experience by providing clear feedback during data fetching and when no notes are available."
    },
    {
      "hash": "27dc08d",
      "date": "16.12.2025 19:31",
      "message": "Update NotesModal and useNotesStore components to handle author email more robustly, providing a fallback to 'Unknown' or 'Anonymous' when email is not available. This enhances user experience by ensuring consistent display of author information."
    },
    {
      "hash": "d631c71",
      "date": "16.12.2025 19:15",
      "message": "Refactor NotesModal and useNotesStore components to remove unnecessary error handling in remote notes fetching and simplify subscription logic for note updates. This improves code clarity and maintains functionality."
    },
    {
      "hash": "035ea2a",
      "date": "16.12.2025 19:13",
      "message": "Enhance NotesModal component to support user authentication, integrating remote note management with local storage fallback. Implement debounced updates for note content and title, ensuring smooth synchronization. Update UI to reflect loading states and author information, improving user experience for both local and cloud notes."
    },
    {
      "hash": "ed2d39d",
      "date": "16.12.2025 18:43",
      "message": "Refactor AuthModal and useAuthStore components to streamline authentication logic. Remove unnecessary data destructuring in signUp and signIn methods, and add placeholder for signInWithEmail implementation to suppress linter errors."
    },
    {
      "hash": "1697b4d",
      "date": "16.12.2025 18:40",
      "message": "Update dependencies in package.json and package-lock.json, adding @supabase/supabase-js and zustand. Enhance MainMenu component with user authentication features, including login/logout functionality and user profile display. Update version history to reflect changes."
    },
    {
      "hash": "bb80843",
      "date": "16.12.2025 10:32",
      "message": "Update Chalkboard component import statement for cleaner code structure."
    },
    {
      "hash": "457589f",
      "date": "16.12.2025 10:30",
      "message": "Refactor Chalkboard component to use global event listeners for pointer events, improving drawing responsiveness and simplifying event handling. Remove unnecessary local references and optimize stroke updates."
    },
    {
      "hash": "e0aae57",
      "date": "16.12.2025 10:23",
      "message": "Update Chalkboard component to start fading strokes after 10 seconds instead of 5 seconds, enhancing visual effects."
    },
    {
      "hash": "efd998b",
      "date": "16.12.2025 10:19",
      "message": "Add Chalkboard component to MainMenu"
    },
    {
      "hash": "e507de4",
      "date": "16.12.2025 10:06",
      "message": "Update VersionModal component and version history data for version 0.0.89, improving commit list rendering and adding new commit details."
    },
    {
      "hash": "8a194a6",
      "date": "16.12.2025 10:04",
      "message": "Update package.json scripts to include version generation and enhance MainMenu with version history feature. Add version badge and modal for displaying version information, improving user experience and accessibility to version details."
    },
    {
      "hash": "b31dfc5",
      "date": "16.12.2025 09:30",
      "message": "Enhance NotesModal component by adding a new resize handle for the bottom side, allowing users to resize the modal vertically. Update interaction handling to support the new 'resize-s' type, improving overall user experience with modal resizing functionality."
    },
    {
      "hash": "78fa9cf",
      "date": "16.12.2025 08:49",
      "message": "Refactor NotesModal to consolidate window state management, enabling persistent resizing and repositioning. Introduce new resize handles for improved user interaction and update local storage handling for window dimensions."
    },
    {
      "hash": "ad7aa88",
      "date": "16.12.2025 08:45",
      "message": "Refactor NotesModal component to enhance interaction handling for resizing and moving. Introduce new state management for position and size, improving user experience with draggable and resizable modal functionality."
    },
    {
      "hash": "0cdfdef",
      "date": "16.12.2025 05:18",
      "message": "Add Notes feature to DeckbuilderScreen with modal integration"
    },
    {
      "hash": "6cedb54",
      "date": "16.12.2025 04:45",
      "message": "Add visual effects for Junk and Bones abilities in GameScreen"
    },
    {
      "hash": "ab189e7",
      "date": "16.12.2025 04:43",
      "message": "Enhance GameScreen and gameReducer to prevent selling 'skull' items from the backpack. Update visual feedback for 'skull' sales and adjust hand clearing logic to include 'skull' type, improving game state management and user experience."
    },
    {
      "hash": "43af456",
      "date": "16.12.2025 04:08",
      "message": "Remove 'graveyard' ability and associated logic from monster abilities and game reducer. Update relevant types to reflect this change, streamlining the codebase and improving maintainability."
    },
    {
      "hash": "a09435f",
      "date": "16.12.2025 04:02",
      "message": "Remove 'Барьер' spell and related logic from GameScreen and gameReducer. Update spell types and adjust GameScreen's non-damage removal checks accordingly to reflect the changes in spell availability."
    },
    {
      "hash": "a68387e",
      "date": "16.12.2025 03:59",
      "message": "Enhance GameScreen logic to handle monster fleeing scenarios. Introduce specific checks for 'БЕГСТВО' log to accurately reflect damage taken during escape. Update monster ability description for clarity on fleeing conditions. Improve logging for monster attacks to include HP details upon fleeing."
    },
    {
      "hash": "a5e4697",
      "date": "16.12.2025 03:46",
      "message": "Implement sequential HP visualization in GameScreen. Introduce HpUpdate interface and update gameReducer to manage HP changes with timestamps. Refactor HP display logic to use visualHp state for smoother animations during gameplay."
    },
    {
      "hash": "8a7665c",
      "date": "16.12.2025 03:33",
      "message": "Update 'whisper' ability description and logic to reflect card peeking mechanics. Adjust logging messages for clarity when no cards are available in the deck."
    },
    {
      "hash": "52eb99a",
      "date": "16.12.2025 03:28",
      "message": "Fix GameScreen backpack reference to correctly access card ID. Remove unused gamePlusReducer file to streamline codebase and improve maintainability."
    },
    {
      "hash": "c60c72e",
      "date": "16.12.2025 03:26",
      "message": "Refactor GameScreen and gameReducer to improve reset logic. Introduce canReset condition based on player HP and cards on the table, enhancing game state management. Update reset button styling to reflect new reset conditions, ensuring better user experience during gameplay."
    },
    {
      "hash": "ec0439b",
      "date": "16.12.2025 03:10",
      "message": "Enhance game state management by introducing a location prop for Card and Slot components, allowing for better tracking of card positions (hand, backpack, field). Update GameScreen and gameReducer to accommodate the new structure, ensuring proper handling of card interactions and state updates. Refactor related components to improve code clarity and maintainability."
    },
    {
      "hash": "652b583",
      "date": "15.12.2025 23:06",
      "message": "Enhance CardComponent and Slot components with drag state management. Add onDragChange prop to CardComponent for notifying parent about drag status. Update Slot component to handle child dragging state and adjust visual feedback accordingly, improving user interaction during drag-and-drop operations."
    },
    {
      "hash": "d5dee77",
      "date": "15.12.2025 16:23",
      "message": "Refactor GamePlusScreen component by removing unused imports and interface definitions, and re-enable saveRun functionality. Update index.css to remove duplicate font import. Clean up gameReducer by removing deadCoin case, streamlining the code for better maintainability."
    },
    {
      "hash": "49942af",
      "date": "15.12.2025 16:16",
      "message": "!!!2"
    },
    {
      "hash": "28cd500",
      "date": "15.12.2025 16:00",
      "message": "!!!"
    },
    {
      "hash": "16f70fd",
      "date": "15.12.2025 12:23",
      "message": "Remove 'public' from .gitignore to streamline ignored files, ensuring only relevant directories are excluded from version control."
    },
    {
      "hash": "636e844",
      "date": "15.12.2025 12:17",
      "message": "Fix image path in MainMenu component by correcting the filename format for the extra image. This update ensures proper loading of the image asset and maintains consistency in the image naming convention."
    },
    {
      "hash": "e663eb0",
      "date": "15.12.2025 12:14",
      "message": "Add sticker functionality to MainMenu component. Implement random sticker images with dynamic positioning and interactive features, enhancing visual engagement and user experience. Include a fullscreen overlay for enlarged sticker viewing with captions."
    },
    {
      "hash": "e629429",
      "date": "15.12.2025 10:30",
      "message": "Update quotes in MainMenu component to reflect new humorous messages about Serega and Kirill. This change enhances the thematic engagement of the interface by adding fresh, playful content that resonates with the game's spirit."
    },
    {
      "hash": "26c1299",
      "date": "15.12.2025 10:28",
      "message": "Add dynamic footer quotes to MainMenu component. Implement a rotating quote feature that updates every 5 seconds, enhancing user engagement with humorous and thematic messages related to the game. This update enriches the overall user experience and adds a playful element to the interface."
    },
    {
      "hash": "0b3db49",
      "date": "15.12.2025 10:11",
      "message": "Refactor drag event handling in GameScreen components to improve code consistency. Update onDragEnd callbacks in CardsViewer, OverheadStatsWindow, and GameLogWindow to remove unused event parameter, enhancing readability and maintainability."
    }
  ]
}